[
  {
    "id": "clinical-psychologist-remote-uk",
    "title": "Clinical Psychologist (Freelance, Remote – UK)",
    "icon": "pi-face-smile",
    "department": "Clinical",
    "location": "United Kingdom",
    "locationType": "Remote",
    "contractType": "Freelance",
    "compensation": "£400–£500 per case",
    "shortDescription": "Join Nova Clinic's remote network delivering autism and ADHD assessments with the full backing of our clinical operations team.",
    "longDescription": "Provide high-quality autism and ADHD assessments for children across the UK while enjoying total control over your schedule. We manage referrals, admin, and reporting so you can stay focused on outcomes.",
    "publishedDate": "2024-07-08",
    "status": "open",
    "overviewHighlights": [
      "Flexible scheduling — set your remote hours on your own terms.",
      "Clinical, administrative, and technical support handled by Nova.",
      "Transparent compensation with consistent caseloads.",
      "A collaborative clinician community focused on growth and supervision.",
      "Mission-driven culture grounded in integrity, empathy, and innovation."
    ],
    "responsibilities": [
      "Lead autism and ADHD assessments for children and young people.",
      "Deliver comprehensive diagnostic reports aligned with NICE / NHS guidance.",
      "Partner with multi-disciplinary professionals when a case needs it.",
      "Translate insights to families with clarity and empathy.",
      "Maintain accurate clinical records within Nova's secure platform.",
      "Continuously improve assessment quality and operating standards."
    ],
    "requirements": [
      "HCPC registration as a Practitioner Psychologist (Clinical, Educational, or Counselling).",
      "Proven experience delivering neurodevelopmental assessments (autism and/or ADHD).",
      "Exceptional written communication and diagnostic reporting skills.",
      "Commitment to ethical practice, clinical excellence, and family-centred care.",
      "Confidence working independently while managing a remote caseload."
    ],
    "conclusion": "Nova Clinic is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees."
  },
  {
    "id": "digital-marketing-assistant",
    "title": "Digital Marketing Assistant (Part-time, Remote)",
    "icon": "pi-megaphone",
    "department": "Marketing",
    "location": "United Kingdom",
    "locationType": "Remote",
    "contractType": "Part-time",
    "compensation": "£1,400–£1,800/month",
    "shortDescription": "Help us grow our online presence with creative campaigns, content optimization, and social storytelling.",
    "longDescription": "Work closely with the growth team to build campaigns that educate families and clinicians about Nova Clinic's services. You will own social calendars, email journeys, lightweight design requests, and reporting.",
    "publishedDate": "2024-06-20",
    "status": "open",
    "overviewHighlights": [
      "Build campaigns that educate families and clinicians in a sensitive space.",
      "Collaborate with a lean growth team that values experimentation.",
      "Access to design, engineering, and clinical partners for rapid iteration.",
      "Clear KPIs and reporting support so you can measure impact.",
      "Remote-first culture with async rituals that respect your schedule."
    ],
    "responsibilities": [
      "Own the social media calendar and publish thoughtful weekly content.",
      "Draft and send lifecycle emails that nurture families, schools, and clinicians.",
      "Ship lightweight design assets in Canva or Figma to support campaigns.",
      "Monitor performance analytics and suggest optimisations every sprint.",
      "Collaborate with clinicians to ensure every story reflects our tone of care."
    ],
    "requirements": [
      "1–3 years of hands-on digital marketing or content experience.",
      "Confidence writing copy for social, email, and landing pages.",
      "Comfort interpreting campaign analytics and making recommendations.",
      "Working knowledge of Canva, Figma, or similar for simple assets.",
      "High empathy for families navigating neurodevelopmental journeys."
    ],
    "conclusion": "Nova Clinic is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees."
  },
  {
    "id": "care-coordinator",
    "title": "Care Coordinator (Full-time, Hybrid – London)",
    "icon": "pi-users",
    "department": "Operations",
    "location": "London, United Kingdom",
    "locationType": "Hybrid",
    "contractType": "Full-time",
    "compensation": "£32,000–£36,000/year",
    "shortDescription": "Be the first point of contact for families, supporting them through scheduling, preparation, and follow-up.",
    "longDescription": "Coordinate assessments end-to-end, making sure every family feels informed and cared for. You'll work with clinicians, schools, and partners to keep each case moving smoothly.",
    "publishedDate": "2024-05-12",
    "status": "closed",
    "overviewHighlights": [
      "Guide families through a sensitive diagnostic journey with warmth.",
      "Hybrid schedule with 2–3 anchor days in our London hub.",
      "Direct partnership with clinical leadership and operations.",
      "Clear progression path as we scale service delivery.",
      "Tools and templates that remove repetitive admin."
    ],
    "responsibilities": [
      "Manage inbound referrals and triage enquiries with empathy.",
      "Own scheduling, reminders, and follow-ups for every assessment.",
      "Coordinate with clinicians, schools, and local authorities when needed.",
      "Keep records accurate inside our CRM and clinical systems.",
      "Surface operational insights that improve family experience."
    ],
    "requirements": [
      "Experience in patient coordination, education, or family services.",
      "Calm, clear written and verbal communication skills.",
      "Fluency with modern productivity and CRM tools.",
      "Ability to juggle multiple cases while staying detail-oriented.",
      "Comfort working across in-person and remote environments."
    ],
    "conclusion": "Nova Clinic is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees."
  },
  {
    "id": "product-designer",
    "title": "Product Designer (Contract, Remote)",
    "icon": "pi-pencil",
    "department": "Product",
    "location": "United Kingdom / Europe",
    "locationType": "Remote",
    "contractType": "Contract",
    "compensation": "£350–£400/day",
    "shortDescription": "Design intuitive clinician and family experiences that translate complex care workflows into simple journeys.",
    "longDescription": "Collaborate with product, engineering, and clinical SMEs to shape Nova Clinic's digital products. You'll lead discovery, design systems, and rapid prototyping for new patient-facing features.",
    "publishedDate": "2024-06-30",
    "status": "open",
    "overviewHighlights": [
      "High-impact roadmap focused on clinician enablement and family access.",
      "Work with clinical SMEs who love partnering on research.",
      "Design system foundations ready for the next layer of polish.",
      "Async-first rituals with focused collaboration windows.",
      "Contract flexibility with potential to extend."
    ],
    "responsibilities": [
      "Plan and run discovery sessions with clinicians and families.",
      "Translate insights into user journeys, wireframes, and polished UI.",
      "Evolve our multi-platform design system with scalable components.",
      "Prototype and test flows to validate hypotheses quickly.",
      "Hand off to engineering with clear specs and partner through QA."
    ],
    "requirements": [
      "Portfolio showcasing complex service or healthcare workflows.",
      "Fluency in Figma plus motion/prototyping tools.",
      "Comfort running qualitative research and synthesising findings.",
      "Systems thinking mindset with an eye for craft.",
      "Experience collaborating asynchronously across product and engineering."
    ],
    "conclusion": "Nova Clinic is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees."
  }
]
